
let yourMoney = +prompt ( "ادخل الاموال ");


let wife = confirm ( "هل الزوجة علي قيدالحياة ?");
let sons = +prompt("كم عدد الاولاد");
let girls = +prompt(" كم عدد البنات ");


let wifeMoney=yourMoney *1/8;

let res=yourMoney-wifeMoney; 

let girl= res /3;
let child=res-girl;
//wife if dead   
let girl2= yourMoney /3;
let child2=yourMoney-girl2;

if (wife==true) {  

    if(sons== 1&&girls==1)

     {  alert( "نصيب الزوجة="+ wifeMoney+('\n')+
      "نصيب الولد " +child +('\n')+
      "نصيب البنت= "+ girl  );}
   
     else if(sons== 0 && girls==1)

      {  alert( "نصيب الزوجة="+ wifeMoney+('\n')+
       "نصيب البنت= "+ res  );}

      else if(sons== 1&&girls==0)

       {  alert( "نصيب الزوجة="+ wifeMoney+('\n')+
        "نصيب الولد= "+ res  );}




       else if (sons==2&&girls==2)              
        
        {alert  ("نصيب الزوجة= " +wifeMoney+('\n')+
        "نصيب الولد الاول= "  + child/2  +('\n')+
        "نصيب الولد الثاني=" + child/2  +('\n')+
         "نصيب البنت الاولي= "  +girl/2    +('\n')+
        "نصيب البنت الثانية= " +girl/2              );}


       else if (sons==2&&girls==0)              
        
        {alert  ("نصيب الزوجة= " +wifeMoney+('\n')+
         "نصيب الولد الاول= "  +res/2    +('\n')+
        "نصيب الولد الثاني= " +res/2              );}
       

      else  if (sons==0&&girls==2)              
        
        {alert  ("نصيب الزوجة= " +wifeMoney+('\n')+
         "نصيب البنت الاولي= "  +res/2    +('\n')+
        "نصيب البنت الثانية= " +res/2              );}




        // وصلنا لحدهنااااااا
       else if (sons==1&&girls==2)              
        
        {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
         "نصيب الولد الاول= "   + res/2    +('\n')+
          "نصيب البنت الاولي= "  + res/4   +('\n')+
           "نصيب البنت الثانية= " + res/4  );}

           else if (sons==2&&girls==1)              
        
           {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
            "نصيب الولد الاول= "   + res* 2/5    +('\n')+
            "نصيب الولد الثاني= "   + res* 2/5   +('\n')+
              "نصيب البنت الاولي= " + res/5  );}

         else  if (sons==1&&girls==3)              
        
           {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
            "نصيب الولد الاول= "   +  res* 2/5   +('\n')+
             "نصيب البنت الاولي= "  + res/5   +('\n')+
             "نصيب البنت الثانية= "  + res/5   +('\n')+
              "نصيب البنت الثالثة= " + res/5  );}

            else  if (sons==1&&girls==4)              
        
              {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
               "نصيب الولد الاول= "   +  res* 2/6   +('\n')+
                "نصيب البنت الاولي= "  + res/6   +('\n')+
                "نصيب البنت الثانية= "  + res/6   +('\n')+
                "نصيب البنت الثالثة= "  + res/6   +('\n')+
                 "نصيب البنت الرابعة= " + res/6  );}

                 
             else if (sons==1&&girls==5)              
        
              {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
               "نصيب الولد الاول= "   +  res* 2/7   +('\n')+
                "نصيب البنت الاولي= "  + res/7   +('\n')+
                "نصيب البنت الثانية= "  + res/7   +('\n')+
                "نصيب البنت الثالثة= "  + res/7   +('\n')+
                "نصيب البنت الرابعة = "  + res/7   +('\n')+
                 "نصيب البنت الخامسة= " + res/7  );}

                else if (sons==1&&girls==6)              
        
                 {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                  "نصيب الولد الاول= "   +  res/4   +('\n')+
                   "نصيب البنت الاولي= "  + res/8  +('\n')+
                   "نصيب البنت الثانية= "  + res/8   +('\n')+
                   "نصيب البنت الثالثة= "  + res/8   +('\n')+
                   "نصيب البنت الرابعة = "  + res/8   +('\n')+
                   "نصيب البنت الخامسة = "  + res/8   +('\n')+
                    "نصيب البنت السادسة= " + res/8 );}

             
             else if (sons==2&&girls==3)              
        
              {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
              "نصيب الولد الاول= "  + res  /3.5   +('\n')+
              "نصيب الولد الثاني= "  +res  /3.5   +('\n')+
                "نصيب البنت الاولي= "  + res/7   +('\n')+
                "نصيب البنت الثانية= "  + res/7   +('\n')+
                 "نصيب البنت الثالثة= " + res/7  );}


               else  if (sons==3&&girls==4)              
        
                 {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                 "نصيب الولد الاول= "  + res  /5   +('\n')+
                 "نصيب الولد الثاني= "  +res  /5   +('\n')+
                 "نصيب الولد الثالث= "  +res  /5   +('\n')+
                   "نصيب البنت الاولي= "  + res/10   +('\n')+
                   "نصيب البنت الثانية= "  + res/10   +('\n')+
                   "نصيب البنت الثالثة= "  + res/10  +('\n')+
                    "نصيب البنت الرابعة= " + res/10 );}

                   else if (sons==3&&girls==5)              
        
                    {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                    "نصيب الولد الاول= "  + res  /5.5   +('\n')+
                    "نصيب الولد الثاني= "  +res  /5.5   +('\n')+
                    "نصيب الولد الثالث= "  +res  /5.5   +('\n')+
                      "نصيب البنت الاولي= "  + res/11   +('\n')+
                      "نصيب البنت الثانية= "  + res/11   +('\n')+
                      "نصيب البنت الثالثة= "  + res/11  +('\n')+
                      "نصيب البنت الرابعة= "  + res/11  +('\n')+
                       "نصيب البنت الخامسة= " + res/11 );}

                    else   if (sons==3&&girls==6)              
        
                       {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                       "نصيب الولد الاول= "  + res  /6   +('\n')+
                       "نصيب الولد الثاني= "  +res  /6   +('\n')+
                       "نصيب الولد الثالث= "  +res  /6   +('\n')+
                         "نصيب البنت الاولي= "  + res/12   +('\n')+
                         "نصيب البنت الثانية= "  + res/12   +('\n')+
                         "نصيب البنت الثالثة= "  + res/12  +('\n')+
                         "نصيب البنت الرابعة= "  + res/12  +('\n')+
                         "نصيب البنت الخامسة= "  + res/12  +('\n')+
                          "نصيب البنت السادسة= " + res/12 );}

                   else    if (sons==4&&girls==5)              
        
                       {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                       "نصيب الولد الاول= "  + res  /6.5   +('\n')+
                       "نصيب الولد الثاني= "  +res  /6.5 +('\n')+
                       "نصيب الولد الثالث= "  +res  /6.5   +('\n')+
                       "نصيب الولد الرابع= "  +res  /6.5   +('\n')+
                         "نصيب البنت الاولي= "  + res/13   +('\n')+
                         "نصيب البنت الثانية= "  + res/13   +('\n')+
                         "نصيب البنت الثالثة= "  + res/13  +('\n')+
                         "نصيب البنت الرابعة= "  + res/13  +('\n')+
                          "نصيب البنت الخامسة= " + res/13 );}

                        else  if (sons==4&&girls==6)              
        
                          {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                          "نصيب الولد الاول= "  + res  /7   +('\n')+
                          "نصيب الولد الثاني= "  +res  /7 +('\n')+
                          "نصيب الولد الثالث= "  +res  /7  +('\n')+
                          "نصيب الولد الرابع= "  +res  /7   +('\n')+
                            "نصيب البنت الاولي= "  + res/14   +('\n')+
                            "نصيب البنت الثانية= "  + res/14   +('\n')+
                            "نصيب البنت الثالثة= "  + res/14  +('\n')+
                            "نصيب البنت الرابعة= "  + res/14  +('\n')+
                            "نصيب البنت الخامسة= "  + res/14  +('\n')+
                             "نصيب البنت السادسة= " + res/14 );}

                          else   if (sons==5&&girls==6)              
        
                             {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                             "نصيب الولد الاول= "  + res  /8   +('\n')+
                             "نصيب الولد الثاني= "  +res  /8 +('\n')+
                             "نصيب الولد الثالث= "  +res  /8  +('\n')+
                             "نصيب الولد الرابع= "  +res  /8   +('\n')+
                             "نصيب الولد الخامس= "  +res  /8   +('\n')+
                               "نصيب البنت الاولي= "  + res/16   +('\n')+
                               "نصيب البنت الثانية= "  + res/16   +('\n')+
                               "نصيب البنت الثالثة= "  + res/16  +('\n')+
                               "نصيب البنت الرابعة= "  + res/16  +('\n')+
                               "نصيب البنت الخامسة= "  + res/16  +('\n')+
                                "نصيب البنت السادسة= " + res/16 );}
   

                else if (sons==2&&girls==4)              
        
                 {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                 "نصيب الولد الاول= "  + res  /4   +('\n')+
                 "نصيب الولد الثاني= "  +res  /4   +('\n')+
                   "نصيب البنت الاولي= "  + res/8   +('\n')+
                   "نصيب البنت الثانية= "  + res/8   +('\n')+
                   "نصيب البنت الثالثة= "  + res/8   +('\n')+
                    "نصيب البنت الرابعة= " + res/8  );}

                else    if (sons==2&&girls==5)              
        
                    {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                    "نصيب الولد الاول= "  + res  /4.5   +('\n')+
                    "نصيب الولد الثاني= "  +res  /4.5   +('\n')+
                      "نصيب البنت الاولي= "  + res/9   +('\n')+
                      "نصيب البنت الثانية= "  + res/9   +('\n')+
                      "نصيب البنت الثالثة= "  + res/9   +('\n')+
                      "نصيب البنت الرابعة= "  + res/9   +('\n')+
                       "نصيب البنت الخامسة= " + res/9  );}

                   else    if (sons==2&&girls==6)              
        
                       {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                       "نصيب الولد الاول= "  + res  /5   +('\n')+
                       "نصيب الولد الثاني= "  +res  /5   +('\n')+
                         "نصيب البنت الاولي= "  + res/10   +('\n')+
                         "نصيب البنت الثانية= "  + res/10   +('\n')+
                         "نصيب البنت الثالثة= "  + res/10  +('\n')+
                         "نصيب البنت الرابعة= "  + res/10  +('\n')+
                         "نصيب البنت الخامسة= "  + res/10  +('\n')+
                          "نصيب البنت السادسة= " + res/10 );}
   

               else  if (sons==3&&girls==2)              
        
                 {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                 "نصيب الولد الاول= "  + res  /4   +('\n')+
                 "نصيب الولد الثاني= "  +res  /4   +('\n')+
                 "نصيب الولد الثالث= "  +res  /4   +('\n')+
                   "نصيب البنت الاولي= "  + res/8   +('\n')+
                    "نصيب البنت الثانية= " + res/8  );}


                   else if (sons==4&&girls==3)              
        
                    {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                    "نصيب الولد الاول= "  + res  /5.5   +('\n')+
                    "نصيب الولد الثاني= "  +res  /5.5 +('\n')+
                    "نصيب الولد الثالث= "  +res  /5.5   +('\n')+
                    "نصيب الولد الرابع= "  +res  /5.5   +('\n')+
                      "نصيب البنت الاولي= "  + res/11   +('\n')+
                      "نصيب البنت الثانية= "  + res/11   +('\n')+
                       "نصيب البنت الثالثة= " + res/11);}

                      else if (sons==5&&girls==3)              
        
                       {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                       "نصيب الولد الاول= "  + res  /6.5   +('\n')+
                       "نصيب الولد الثاني= "  +res  /6.5 +('\n')+
                       "نصيب الولد الثالث= "  +res  /6.5   +('\n')+
                       "نصيب الولد الرابع= "  +res  /6.5   +('\n')+
                       "نصيب الولد الخامس= "  +res  /6.5   +('\n')+
                         "نصيب البنت الاولي= "  + res/13   +('\n')+
                         "نصيب البنت الثانية= "  + res/13   +('\n')+
                          "نصيب البنت الثالثة= " + res/13);}

                          else if (sons==6&&girls==3)              
        
                          {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                          "نصيب الولد الاول= "  + res  /7.5   +('\n')+
                          "نصيب الولد الثاني= "  +res  /7.5 +('\n')+
                          "نصيب الولد الثالث= "  +res  /7.5   +('\n')+
                          "نصيب الولد الرابع= "  +res  /7.5   +('\n')+
                          "نصيب الولد الخامس= "  +res  /7.5   +('\n')+
                          "نصيب الولد السادس= "  +res  /7.5   +('\n')+
                            "نصيب البنت الاولي= "  + res/15   +('\n')+
                            "نصيب البنت الثانية= "  + res/15   +('\n')+
                             "نصيب البنت الثالثة= " + res/15 );}

                       else   if (sons==5&&girls==4)              
        
                          {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                          "نصيب الولد الاول= "  + res  /7   +('\n')+
                          "نصيب الولد الثاني= "  +res  /7 +('\n')+
                          "نصيب الولد الثالث= "  +res  /7   +('\n')+
                          "نصيب الولد الرابع= "  +res  /7   +('\n')+
                          "نصيب الولد الخامس= "  +res  /7   +('\n')+
                            "نصيب البنت الاولي= "  + res/14   +('\n')+
                            "نصيب البنت الثانية= "  + res/14   +('\n')+
                            "نصيب البنت الثالثة= "  + res/14   +('\n')+
                             "نصيب البنت الرابعة= " + res/14);}

                           else  if (sons==6&&girls==4)              
        
                             {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                             "نصيب الولد الاول= "  + res  /8   +('\n')+
                             "نصيب الولد الثاني= "  +res  /8 +('\n')+
                             "نصيب الولد الثالث= "  +res  /8   +('\n')+
                             "نصيب الولد الرابع= "  +res  /8   +('\n')+
                             "نصيب الولد الخامس= "  +res  /8   +('\n')+
                             "نصيب الولد السادس= "  +res  /8   +('\n')+
                               "نصيب البنت الاولي= "  + res/16   +('\n')+
                               "نصيب البنت الثانية= "  + res/16   +('\n')+
                               "نصيب البنت الثالثة= "  + res/16   +('\n')+
                                "نصيب البنت الرابعة= " + res/16);}



                              else  if (sons==6&&girls==5)              
        
                                {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                                "نصيب الولد الاول= "  + res  /8.5   +('\n')+
                                "نصيب الولد الثاني= "  +res  /8.5 +('\n')+
                                "نصيب الولد الثالث= "  +res  /8.5   +('\n')+
                                "نصيب الولد الرابع= "  +res  /8.5   +('\n')+
                                "نصيب الولد الخامس= "  +res  /8.5   +('\n')+
                                "نصيب الولد السادس= "  +res  /8.5   +('\n')+
                                  "نصيب البنت الاولي= "  + res/17   +('\n')+
                                  "نصيب البنت الثانية= "  + res/17   +('\n')+
                                  "نصيب البنت الثالثة= "  + res/17   +('\n')+
                                  "نصيب البنت الرابعة= "  + res/17   +('\n')+
                                   "نصيب البنت الخامسة= " + res/17);}


                            else if (sons==5&&girls==5)              
        
                             {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                             "نصيب الولد الاول= "  + res  /7.5   +('\n')+
                             "نصيب الولد الثاني= "  +res  /7.5 +('\n')+
                             "نصيب الولد الثالث= "  +res  /7.5   +('\n')+
                             "نصيب الولد الرابع= "  +res  /7.5   +('\n')+
                             "نصيب الولد الخامس= "  +res  /7.5   +('\n')+
                               "نصيب البنت الاولي= "  + res/15   +('\n')+
                               "نصيب البنت الثانية= "  + res/15   +('\n')+
                               "نصيب البنت الثالثة= "  + res/15   +('\n')+
                               "نصيب البنت الرابعة= "  + res/15   +('\n')+
                                "نصيب البنت الخامسة= " + res/15);}


                               else if (sons==6&&girls==6)              
        
                                {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                                "نصيب الولد الاول= "  + res  /9   +('\n')+
                                "نصيب الولد الثاني= "  +res  /9 +('\n')+
                                "نصيب الولد الثالث= "  +res  /9  +('\n')+
                                "نصيب الولد الرابع= "  +res  /9   +('\n')+
                                "نصيب الولد الخامس= "  +res  /9   +('\n')+
                                "نصيب الولد السادس= "  +res  /9   +('\n')+
                                  "نصيب البنت الاولي= "  + res/18   +('\n')+
                                  "نصيب البنت الثانية= "  + res/18   +('\n')+
                                  "نصيب البنت الثالثة= "  + res/18  +('\n')+
                                  "نصيب البنت الرابعة= "  + res/18  +('\n')+
                                  "نصيب البنت الخامسة= "  + res/18  +('\n')+
                                   "نصيب البنت السادسة= " + res/18 );}
      
   


                      else if (sons==4&&girls==4)              
        
                       {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                       "نصيب الولد الاول= "  + res  /6   +('\n')+
                       "نصيب الولد الثاني= "  +res  /6+('\n')+
                       "نصيب الولد الثالث= "  +res  /6   +('\n')+
                       "نصيب الولد الرابع= "  +res  /6 +('\n')+
                         "نصيب البنت الاولي= "  + res/12   +('\n')+
                         "نصيب البنت الثانية= "  + res/12   +('\n')+
                         "نصيب البنت الثالثة= "  + res/12   +('\n')+
                          "نصيب البنت الرابعة= " + res/12);}


                   else if (sons==4&&girls==2)              
        
                    {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                    "نصيب الولد الاول= "  + res  /5   +('\n')+
                    "نصيب الولد الثاني= "  +res  /5   +('\n')+
                    "نصيب الولد الثالث= "  +res  /5   +('\n')+
                    "نصيب الولد الرايع= "  +res  /5   +('\n')+
                      "نصيب البنت الاولي= "  + res/10   +('\n')+
                       "نصيب البنت الثانية= " + res/10  );}

                    else   if (sons==5&&girls==2)              
        
                       {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                       "نصيب الولد الاول= "  + res  /6   +('\n')+
                       "نصيب الولد الثاني= "  +res  /6   +('\n')+
                       "نصيب الولد الثالث= "  +res  /6   +('\n')+
                       "نصيب الولد الرايع= "  +res  /6   +('\n')+
                       "نصيب الولد الخامس= "  +res  /6   +('\n')+
                         "نصيب البنت الاولي= "  + res/12   +('\n')+
                          "نصيب البنت الثانية= " + res/12  );}

                       else   if (sons==6&&girls==2)              
        
                          {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                          "نصيب الولد الاول= "  + res  /7   +('\n')+
                          "نصيب الولد الثاني= "  +res  /7  +('\n')+
                          "نصيب الولد الثالث= "  +res  /7   +('\n')+
                          "نصيب الولد الرايع= "  +res  /7   +('\n')+
                          "نصيب الولد الخامس= "  +res  /7   +('\n')+
                          "نصيب الولد السادس= "  +res  /7   +('\n')+
                            "نصيب البنت الاولي= "  + res/14   +('\n')+
                             "نصيب البنت الثانية= " + res/14  );}
      
   


             else if (sons==0&&girls==3)              
        
              {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                "نصيب البنت الاولي= "  + res/3   +('\n')+
                "نصيب البنت الثانية= "  + res/3   +('\n')+
                 "نصيب البنت الثالثة= " + res/3  );}

                 
             else if (sons==0   && girls==4)              
        
              {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                "نصيب البنت الاولي= "  + res/4   +('\n')+
                "نصيب البنت الثانية= "  + res/4   +('\n')+
                "نصيب البنت الثالثة= "  + res/4   +('\n')+
                 "نصيب البنت الرابعة= " + res/4 );}

                      
             else if (sons==0&&girls==5)              
        
              {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                "نصيب البنت الاولي= "  + res/5   +('\n')+
                "نصيب البنت الثانية= "  + res/5   +('\n')+
                "نصيب البنت الثالثة= "  + res/5   +('\n')+
                "نصيب البنت الرابعة= "  + res/5   +('\n')+
                 "نصيب البنت الخامسة= " + res/5 );}

                else if (sons==0&&girls==6)              
        
              {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                "نصيب البنت الاولي= "  + res/6   +('\n')+
                "نصيب البنت الثانية= "  + res/6   +('\n')+
                "نصيب البنت الثالثة= "  + res/6   +('\n')+
                "نصيب البنت الرابعة= "  + res/6   +('\n')+
                "نصيب البنت الخامسة= "  + res/6   +('\n')+
                 "نصيب البنت السادسة= " + res/6 );}

             else    if (sons==3&&girls==0)              
        
                 {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                   "نصيب الولد الاول= "  + res/3   +('\n')+
                   "نصيب الولد الثاني= "  + res/3   +('\n')+
                    "نصيب الولد الثالث= " + res/3  );}

                 else   if (sons==4&&girls==0)              
        
                    {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                      "نصيب الولد الاول= "  + res/4   +('\n')+
                      "نصيب الولد الثاني= "  + res/4   +('\n')+
                      "نصيب الولد الثالث= "  + res/4   +('\n')+
                       "نصيب الولد الرابع= " + res/4  );}

                     else  if (sons==5&&girls==0)              
        
                       {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                         "نصيب الولد الاول= "  + res/5   +('\n')+
                         "نصيب الولد الثاني= "  + res/5   +('\n')+
                         "نصيب الولد الثالث= "  + res/5   +('\n')+
                         "نصيب الولد الرابع= "  + res/5   +('\n')+
                          "نصيب الولد الخامس= " + res/5  );}

                       else   if (sons==6&&girls==0)              
        
                          {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                            "نصيب الولد الاول= "  + res/6   +('\n')+
                            "نصيب الولد الثاني= "  + res/6   +('\n')+
                            "نصيب الولد الثالث= "  + res/6   +('\n')+
                            "نصيب الولد الرابع= "  + res/6   +('\n')+
                            "نصيب الولد الخامس= "  + res/6   +('\n')+
                             "نصيب الولد السادس= " + res/6  );}
         
      
   
                  else  if (sons==3&&girls==1)              
        
                    {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                      "نصيب الولد الاول= "  + res  /3.5   +('\n')+
                      "نصيب الولد الثاني= "  +res  /3.5   +('\n')+
                      "نصيب الولد الثالث= "  + res  /3.5   +('\n')+
                       "نصيب البنت الاولي= " + res/7  );}

                       
                   else if (sons==4&&girls==1)              
        
                    {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                      "نصيب الولد الاول= "  + res  /4.5   +('\n')+
                      "نصيب الولد الثاني= "  +res  /4.5   +('\n')+
                      "نصيب الولد الثالث= "  + res  /4.5   +('\n')+
                      "نصيب الولد الرابع= "  + res  /4.5   +('\n')+
                       "نصيب البنت الاولي= " + res/9  );}

                     else  if (sons==5&&girls==1)              
        
                       {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                         "نصيب الولد الاول= "  + res  /5.5   +('\n')+
                         "نصيب الولد الثاني= "  +res  /5.5   +('\n')+
                         "نصيب الولد الثالث= "  + res  /5.5   +('\n')+
                         "نصيب الولد الرابع= "  + res  /5.5   +('\n')+
                         "نصيب الولد الخامس= "  + res  /5.5   +('\n')+
                          "نصيب البنت الاولي= " + res/11  );
                        }

                        else  if (sons==6&&girls==1)              
        
                          {alert  ("نصيب الزوجة= " +wifeMoney  +('\n')+
                            "نصيب الولد الاول= "  + res  /6.5   +('\n')+
                            "نصيب الولد الثاني= "  +res  /6.5   +('\n')+
                            "نصيب الولد الثالث= "  + res  /6.5   +('\n')+
                            "نصيب الولد الرابع= "  + res  /6.5   +('\n')+
                            "نصيب الولد الخامس= "  + res  /6.5   +('\n')+
                            "نصيب الولد السادس= "  + res  /6.5   +('\n')+
                             "نصيب البنت الاولي= " + res/7  );}
      
      
   
   





      else  if (sons==3&&girls==3)              
        
        {alert  ("نصيب الزوجة= " +wifeMoney+('\n')+
        "نصيب الولد الاول= "  + child/3  +('\n')+
        "نصيب الولد الثاني= " + child/3 +('\n')+
        "نصيب الولد الثالث= " + child/3 +('\n')+
         "نصيب البنت الاولي= "  +girl/3    +('\n')+
         "نصيب البنت الثانية= "  +girl/3    +('\n')+
        "نصيب البنت الثاثة =" +girl/3    );}


         
 



}



else {  


    if(sons== 1 )         if(girls==1)

     {  alert("الله يرحمها ويسامحها كانت طيبة"+('\n')+
      "نصيب الولد=  " + child2 +('\n')+
      "نصيب البنت= "+ girl2  )};
   
      if(sons== 0 )         if(girls==1)

      {  alert( "الله يرحمها ويسامحها كانت طيبة"+('\n')+
       "نصيب البنت= "+ yourMoney  )};

       if(sons== 1 )         if(girls==0)

       {  alert("الله يرحمها ويسامحها كانت طيبة"+('\n')+
        "نصيب الولد= "+ yourMoney  )};

     if (sons==2)   if(girls==2)              
        
{alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
"نصيب الولد الاول= "  + child2/2  +('\n')+
"نصيب الولد الثاني=" + child2/2  +('\n')+
 "نصيب البنت الاولي= "  +girl2/2    +('\n')+
"نصيب البنت الثانية= " +girl2/2              )};


if (sons==2)   if(girls==0)              

{alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
 "نصيب الولد الاول= "  +yourMoney/2    +('\n')+
"نصيب الولد الثاني= " +yourMoney/2              )};


if (sons==0)   if(girls==2)              

{alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
 "نصيب البنت الاولي= "  +yourMoney/2    +('\n')+
"نصيب البنت الثانية= " +yourMoney/2              )};




if (sons==1)   if(girls==2)              

{alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
 "نصيب الولد الاول= "   + yourMoney/2    +('\n')+
  "نصيب البنت الاولي= "  + yourMoney/4   +('\n')+
   "نصيب البنت الثانية= " + yourMoney/4  )};

   if (sons==2)   if(girls==1)              

   {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
    "نصيب الولد الاول= "   + yourMoney* 2/5    +('\n')+
    "نصيب الولد الثاني= "   + yourMoney* 2/5   +('\n')+
      "نصيب البنت الاولي= " + yourMoney/5  )};

   if (sons==1)   if(girls==3)              

   {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
    "نصيب الولد الاول= "   +  yourMoney* 2/5   +('\n')+
     "نصيب البنت الاولي= "  + yourMoney/5   +('\n')+
     "نصيب البنت الثانية= "  + yourMoney/5   +('\n')+
      "نصيب البنت الثالثة= " + yourMoney/5  )};
     
      if (sons==2)   if(girls==3)              

      {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
      "نصيب الولد الاول= "  + yourMoney  /3.5   +('\n')+
      "نصيب الولد الثاني= "  +yourMoney  /3.5   +('\n')+
        "نصيب البنت الاولي= "  + yourMoney/7   +('\n')+
        "نصيب البنت الثانية= "  + yourMoney/7   +('\n')+
         "نصيب البنت الثالثة= " + yourMoney/7  )};

         if (sons==3)   if(girls==2)              

         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
         "نصيب الولد الاول= "  + yourMoney  /4   +('\n')+
         "نصيب الولد الثاني= "  +yourMoney  /4   +('\n')+
         "نصيب الولد الثالث= "  +yourMoney  /4   +('\n')+
           "نصيب البنت الاولي= "  + yourMoney/8   +('\n')+
            "نصيب البنت الثانية= " + yourMoney/8  )};



      if (sons==0)   if(girls==3)              

      {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
        "نصيب البنت الاولي= "  + yourMoney/3   +('\n')+
        "نصيب البنت الثانية= "  + yourMoney/3   +('\n')+
         "نصيب البنت الثالثة= " + yourMoney/3  )};

         if (sons==3)   if(girls==0)              

         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
           "نصيب الولد الاول= "  + yourMoney/3   +('\n')+
           "نصيب الولد الثاني= "  + yourMoney/3   +('\n')+
            "نصيب الولد الثالث= " + yourMoney/3  )};

            if (sons==3)   if(girls==1)              

            {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
              "نصيب الولد الاول= "  + yourMoney  /3.5   +('\n')+
              "نصيب الولد الثاني= "  +yourMoney  /3.5   +('\n')+
              "نصيب الولد الثالث= "  + yourMoney  /3.5   +('\n')+
               "نصيب البنت الاولي= " + yourMoney/7  )};





if (sons==3)   if(girls==3)              

{alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
"نصيب الولد الاول= "  + child2/3  +('\n')+
"نصيب الولد الثاني= " + child2/3 +('\n')+
"نصيب الولد الثالث= " + child2/3 +('\n')+
 "نصيب البنت الاولي= "  +girl2/3    +('\n')+
 "نصيب البنت الثانية= "  +girl2/3    +('\n')+
"نصيب البنت الثاثة =" +girl2/3    )};


///من هنا جزء   4  


if (sons==1)   if(girls==4)              
        
{alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
 "نصيب الولد الاول= "   +  yourMoney* 2/6   +('\n')+
  "نصيب البنت الاولي= "  + yourMoney/6   +('\n')+
  "نصيب البنت الثانية= "  + yourMoney/6   +('\n')+
  "نصيب البنت الثالثة= "  + yourMoney/6   +('\n')+
   "نصيب البنت الرابعة= " + yourMoney/6  )};

if (sons==3)   if(girls==4)              

   {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
   "نصيب الولد الاول= "  + yourMoney  /5   +('\n')+
   "نصيب الولد الثاني= "  +yourMoney  /5   +('\n')+
   "نصيب الولد الثالث= "  +yourMoney  /5   +('\n')+
     "نصيب البنت الاولي= "  + yourMoney/10   +('\n')+
     "نصيب البنت الثانية= "  + yourMoney/10   +('\n')+
     "نصيب البنت الثالثة= "  + yourMoney/10  +('\n')+
      "نصيب البنت الرابعة= " + yourMoney/10 )};

if (sons==2)   if(girls==4)              

   {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
   "نصيب الولد الاول= "  + yourMoney  /4   +('\n')+
   "نصيب الولد الثاني= "  +yourMoney  /4   +('\n')+
     "نصيب البنت الاولي= "  + yourMoney/8   +('\n')+
     "نصيب البنت الثانية= "  + yourMoney/8   +('\n')+
     "نصيب البنت الثالثة= "  + yourMoney/8   +('\n')+
      "نصيب البنت الرابعة= " + yourMoney/8  )};

if (sons==4)   if(girls==3)              

      {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
      "نصيب الولد الاول= "  + yourMoney  /5.5   +('\n')+
      "نصيب الولد الثاني= "  +yourMoney  /5.5 +('\n')+
      "نصيب الولد الثالث= "  +yourMoney  /5.5   +('\n')+
      "نصيب الولد الرابع= "  +yourMoney  /5.5   +('\n')+
        "نصيب البنت الاولي= "  + yourMoney/11   +('\n')+
        "نصيب البنت الثانية= "  + yourMoney/11   +('\n')+
         "نصيب البنت الثالثة= " + yourMoney/11)};

         if (sons==4)   if(girls==4)              

         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
         "نصيب الولد الاول= "  + yourMoney  /6   +('\n')+
         "نصيب الولد الثاني= "  +yourMoney  /6+('\n')+
         "نصيب الولد الثالث= "  +yourMoney  /6   +('\n')+
         "نصيب الولد الرابع= "  +yourMoney  /6 +('\n')+
           "نصيب البنت الاولي= "  + yourMoney/12   +('\n')+
           "نصيب البنت الثانية= "  + yourMoney/12   +('\n')+
           "نصيب البنت الثالثة= "  + yourMoney/12   +('\n')+
            "نصيب البنت الرابعة= " + yourMoney/12)};

if (sons==4)   if(girls==2)              

      {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
      "نصيب الولد الاول= "  + yourMoney  /5   +('\n')+
      "نصيب الولد الثاني= "  +yourMoney  /5   +('\n')+
      "نصيب الولد الثالث= "  +yourMoney  /5   +('\n')+
      "نصيب الولد الرايع= "  +yourMoney  /5   +('\n')+
        "نصيب البنت الاولي= "  + yourMoney/10   +('\n')+
         "نصيب البنت الثانية= " + yourMoney/10  )};

if (sons==0)   if(girls==4)              

{alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
  "نصيب البنت الاولي= "  + yourMoney/4   +('\n')+
  "نصيب البنت الثانية= "  + yourMoney/4   +('\n')+
  "نصيب البنت الثالثة= "  + yourMoney/4   +('\n')+
   "نصيب البنت الرابعة= " + yourMoney/4 )};

if (sons==4)   if(girls==0)              

      {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
        "نصيب الولد الاول= "  + yourMoney/4   +('\n')+
        "نصيب الولد الثاني= "  + yourMoney/4   +('\n')+
        "نصيب الولد الثالث = "  + yourMoney/4   +('\n')+
         "نصيب الولد الرابع= " + yourMoney/4  )};

if (sons==4)   if(girls==1)              

      {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
        "نصيب الولد الاول= "  + yourMoney  /4.5   +('\n')+
        "نصيب الولد الثاني= "  +yourMoney  /4.5   +('\n')+
        "نصيب الولد الثالث= "  + yourMoney  /4.5   +('\n')+
        "نصيب الولد الرابع= "  + yourMoney  /4.5   +('\n')+
         "نصيب البنت الاولي= " + yourMoney/9  )};

         //من هنا جزء 5
         if (sons==1)   if(girls==5)              
        
         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
          "نصيب الولد الاول= "   +  yourMoney* 2/7   +('\n')+
           "نصيب البنت الاولي= "  + yourMoney/7   +('\n')+
           "نصيب البنت الثانية= "  + yourMoney/7   +('\n')+
           "نصيب البنت الثالثة= "  + yourMoney/7   +('\n')+
           "نصيب البنت الرابعة = "  + yourMoney/7   +('\n')+
            "نصيب البنت الخامسة= " + yourMoney/7  )};


               if (sons==3)   if(girls==5)              
   
               {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
               "نصيب الولد الاول= "  + yourMoney  /5.5   +('\n')+
               "نصيب الولد الثاني= "  +yourMoney  /5.5   +('\n')+
               "نصيب الولد الثالث= "  +yourMoney  /5.5   +('\n')+
                 "نصيب البنت الاولي= "  + yourMoney/11   +('\n')+
                 "نصيب البنت الثانية= "  + yourMoney/11   +('\n')+
                 "نصيب البنت الثالثة= "  + yourMoney/11  +('\n')+
                 "نصيب البنت الرابعة= "  + yourMoney/11  +('\n')+
                  "نصيب البنت الخامسة= " + yourMoney/11 )};

                  if (sons==4)   if(girls==5)              
        
                  {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
                  "نصيب الولد الاول= "  + yourMoney  /6.5   +('\n')+
                  "نصيب الولد الثاني= "  +yourMoney  /6.5 +('\n')+
                  "نصيب الولد الثالث= "  +yourMoney  /6.5   +('\n')+
                  "نصيب الولد الرابع= "  +yourMoney  /6.5   +('\n')+
                    "نصيب البنت الاولي= "  + yourMoney/13   +('\n')+
                    "نصيب البنت الثانية= "  + yourMoney/13   +('\n')+
                    "نصيب البنت الثالثة= "  + yourMoney/13  +('\n')+
                    "نصيب البنت الرابعة= "  + yourMoney/13  +('\n')+
                     "نصيب البنت الخامسة= " + yourMoney/13 )};


if (sons==2)   if(girls==5)              
   
               {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
               "نصيب الولد الاول= "  + yourMoney  /4.5   +('\n')+
               "نصيب الولد الثاني= "  +yourMoney  /4.5   +('\n')+
                 "نصيب البنت الاولي= "  + yourMoney/9   +('\n')+
                 "نصيب البنت الثانية= "  + yourMoney/9   +('\n')+
                 "نصيب البنت الثالثة= "  + yourMoney/9   +('\n')+
                 "نصيب البنت الرابعة= "  + yourMoney/9   +('\n')+
                  "نصيب البنت الخامسة= " + yourMoney/9  )};

if (sons==5)   if(girls==3)              
   
                  {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
                  "نصيب الولد الاول= "  + yourMoney  /6.5   +('\n')+
                  "نصيب الولد الثاني= "  +yourMoney  /6.5 +('\n')+
                  "نصيب الولد الثالث= "  +yourMoney  /6.5   +('\n')+
                  "نصيب الولد الرابع= "  +yourMoney  /6.5   +('\n')+
                  "نصيب الولد الخامس= "  +yourMoney  /6.5   +('\n')+
                    "نصيب البنت الاولي= "  + yourMoney/13   +('\n')+
                    "نصيب البنت الثانية= "  + yourMoney/13   +('\n')+
                     "نصيب البنت الثالثة= " + yourMoney/13)};
if (sons==5)   if(girls==4)              
   
                     {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
                     "نصيب الولد الاول= "  + yourMoney  /7   +('\n')+
                     "نصيب الولد الثاني= "  +yourMoney  /7 +('\n')+
                     "نصيب الولد الثالث= "  +yourMoney  /7   +('\n')+
                     "نصيب الولد الرابع= "  +yourMoney  /7   +('\n')+
                     "نصيب الولد الخامس= "  +yourMoney  /7   +('\n')+
                       "نصيب البنت الاولي= "  + yourMoney/14   +('\n')+
                       "نصيب البنت الثانية= "  + yourMoney/14   +('\n')+
                       "نصيب البنت الثالثة= "  + yourMoney/14   +('\n')+
                        "نصيب البنت الرابعة= " + yourMoney/14)};

if (sons==5)   if(girls==5)              
   
                        {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
                        "نصيب الولد الاول= "  + yourMoney  /7.5   +('\n')+
                        "نصيب الولد الثاني= "  +yourMoney  /7.5 +('\n')+
                        "نصيب الولد الثالث= "  +yourMoney  /7.5   +('\n')+
                        "نصيب الولد الرابع= "  +yourMoney  /7.5   +('\n')+
                        "نصيب الولد الخامس= "  +yourMoney  /7.5   +('\n')+
                          "نصيب البنت الاولي= "  + yourMoney/15   +('\n')+
                          "نصيب البنت الثانية= "  + yourMoney/15   +('\n')+
                          "نصيب البنت الثالثة= "  + yourMoney/15   +('\n')+
                          "نصيب البنت الرابعة= "  + yourMoney/15   +('\n')+
                           "نصيب البنت الخامسة= " + yourMoney/15)};
if (sons==5)   if(girls==2)              
   
                  {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
                  "نصيب الولد الاول= "  + yourMoney  /6   +('\n')+
                  "نصيب الولد الثاني= "  +yourMoney  /6   +('\n')+
                  "نصيب الولد الثالث= "  +yourMoney  /6   +('\n')+
                  "نصيب الولد الرايع= "  +yourMoney  /6   +('\n')+
                  "نصيب الولد الخامس= "  +yourMoney  /6   +('\n')+
                    "نصيب البنت الاولي= "  + yourMoney/12   +('\n')+
                     "نصيب البنت الثانية= " + yourMoney/12  )};
if (sons==0)   if(girls==5)              
   
         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
           "نصيب البنت الاولي= "  + yourMoney/5   +('\n')+
           "نصيب البنت الثانية= "  + yourMoney/5   +('\n')+
           "نصيب البنت الثالثة= "  + yourMoney/5   +('\n')+
           "نصيب البنت الرابعة= "  + yourMoney/5   +('\n')+
            "نصيب البنت الخامسة= " + yourMoney/5 )};
if (sons==5)   if(girls==0)              
   
                  {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
                    "نصيب الولد الاول= "  + yourMoney/5   +('\n')+
                    "نصيب الولد الثاني= "  + yourMoney/5   +('\n')+
                    "نصيب الولد الثالث= "  + yourMoney/5   +('\n')+
                    "نصيب الولد الرابع= "  + yourMoney/5   +('\n')+
                     "نصيب الولد الخامس= " + yourMoney/5  )};
if (sons==5)   if(girls==1)              
   
                  {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
                    "نصيب الولد الاول= "  + yourMoney  /5.5   +('\n')+
                    "نصيب الولد الثاني= "  +yourMoney  /5.5   +('\n')+
                    "نصيب الولد الثالث= "  + yourMoney  /5.5   +('\n')+
                    "نصيب الولد الرابع= "  + yourMoney  /5.5   +('\n')+
                    "نصيب الولد الخامس= "  + yourMoney  /5.5   +('\n')+
                     "نصيب البنت الاولي= " + yourMoney/11  )};


//من هنا جزء 6

if (sons==1)   if(girls==6)              
        
{alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
 "نصيب الولد الاول= "   +  yourMoney/4   +('\n')+
  "نصيب البنت الاولي= "  + yourMoney/8  +('\n')+
  "نصيب البنت الثانية= "  + yourMoney/8   +('\n')+
  "نصيب البنت الثالثة= "  + yourMoney/8   +('\n')+
  "نصيب البنت الرابعة = "  + yourMoney/8   +('\n')+
  "نصيب البنت الخامسة = "  + yourMoney/8   +('\n')+
   "نصيب البنت السادسة= " + yourMoney/8 )};
if (sons==3)   if(girls==6)              

      {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
      "نصيب الولد الاول= "  + yourMoney  /6   +('\n')+
      "نصيب الولد الثاني= "  +yourMoney  /6   +('\n')+
      "نصيب الولد الثالث= "  +yourMoney  /6   +('\n')+
        "نصيب البنت الاولي= "  + yourMoney/12   +('\n')+
        "نصيب البنت الثانية= "  + yourMoney/12   +('\n')+
        "نصيب البنت الثالثة= "  + yourMoney/12  +('\n')+
        "نصيب البنت الرابعة= "  + yourMoney/12  +('\n')+
        "نصيب البنت الخامسة= "  + yourMoney/12  +('\n')+
         "نصيب البنت السادسة= " + yourMoney/12 )};

if (sons==4)   if(girls==6)              

         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
         "نصيب الولد الاول= "  + yourMoney  /7   +('\n')+
         "نصيب الولد الثاني= "  +yourMoney  /7 +('\n')+
         "نصيب الولد الثالث= "  +yourMoney  /7  +('\n')+
         "نصيب الولد الرابع= "  +yourMoney  /7   +('\n')+
           "نصيب البنت الاولي= "  + yourMoney/14   +('\n')+
           "نصيب البنت الثانية= "  + yourMoney/14   +('\n')+
           "نصيب البنت الثالثة= "  + yourMoney/14  +('\n')+
           "نصيب البنت الرابعة= "  + yourMoney/14  +('\n')+
           "نصيب البنت الخامسة= "  + yourMoney/14  +('\n')+
            "نصيب البنت السادسة= " + yourMoney/14 )};
if (sons==5)   if(girls==6)              

            {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
            "نصيب الولد الاول= "  + yourMoney  /8   +('\n')+
            "نصيب الولد الثاني= "  +yourMoney  /8 +('\n')+
            "نصيب الولد الثالث= "  +yourMoney  /8  +('\n')+
            "نصيب الولد الرابع= "  +yourMoney  /8   +('\n')+
            "نصيب الولد الخامس= "  +yourMoney  /8   +('\n')+
              "نصيب البنت الاولي= "  + yourMoney/16   +('\n')+
              "نصيب البنت الثانية= "  + yourMoney/16   +('\n')+
              "نصيب البنت الثالثة= "  + yourMoney/16  +('\n')+
              "نصيب البنت الرابعة= "  + yourMoney/16  +('\n')+
              "نصيب البنت الخامسة= "  + yourMoney/16  +('\n')+
               "نصيب البنت السادسة= " + yourMoney/16 )};
if (sons==2)   if(girls==6)              

      {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
      "نصيب الولد الاول= "  + yourMoney  /5   +('\n')+
      "نصيب الولد الثاني= "  +yourMoney  /5   +('\n')+
        "نصيب البنت الاولي= "  + yourMoney/10   +('\n')+
        "نصيب البنت الثانية= "  + yourMoney/10   +('\n')+
        "نصيب البنت الثالثة= "  + yourMoney/10  +('\n')+
        "نصيب البنت الرابعة= "  + yourMoney/10  +('\n')+
        "نصيب البنت الخامسة= "  + yourMoney/10  +('\n')+
         "نصيب البنت السادسة= " + yourMoney/10 )};
if (sons==6)   if(girls==3)              

         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
         "نصيب الولد الاول= "  + yourMoney  /7.5   +('\n')+
         "نصيب الولد الثاني= "  +yourMoney  /7.5 +('\n')+
         "نصيب الولد الثالث= "  +yourMoney  /7.5   +('\n')+
         "نصيب الولد الرابع= "  +yourMoney  /7.5   +('\n')+
         "نصيب الولد الخامس= "  +yourMoney  /7.5   +('\n')+
         "نصيب الولد السادس= "  +yourMoney  /7.5   +('\n')+
           "نصيب البنت الاولي= "  + yourMoney/15   +('\n')+
           "نصيب البنت الثانية= "  + yourMoney/15   +('\n')+
            "نصيب البنت الثالثة= " + yourMoney/15 )};

if (sons==6)   if(girls==4)              

            {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
            "نصيب الولد الاول= "  + yourMoney  /8   +('\n')+
            "نصيب الولد الثاني= "  +yourMoney  /8 +('\n')+
            "نصيب الولد الثالث= "  +yourMoney  /8   +('\n')+
            "نصيب الولد الرابع= "  +yourMoney  /8   +('\n')+
            "نصيب الولد الخامس= "  +yourMoney  /8   +('\n')+
            "نصيب الولد السادس= "  +yourMoney  /8   +('\n')+
              "نصيب البنت الاولي= "  + yourMoney/16   +('\n')+
              "نصيب البنت الثانية= "  + yourMoney/16   +('\n')+
              "نصيب البنت الثالثة= "  + yourMoney/16   +('\n')+
               "نصيب البنت الرابعة= " + yourMoney/16)};


               if (sons==6)   if(girls==5)              

               {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
               "نصيب الولد الاول= "  + yourMoney  /8.5   +('\n')+
               "نصيب الولد الثاني= "  +yourMoney  /8.5 +('\n')+
               "نصيب الولد الثالث= "  +yourMoney  /8.5   +('\n')+
               "نصيب الولد الرابع= "  +yourMoney  /8.5   +('\n')+
               "نصيب الولد الخامس= "  +yourMoney  /8.5   +('\n')+
               "نصيب الولد السادس= "  +yourMoney  /8.5   +('\n')+
                 "نصيب البنت الاولي= "  + yourMoney/17   +('\n')+
                 "نصيب البنت الثانية= "  + yourMoney/17   +('\n')+
                 "نصيب البنت الثالثة= "  + yourMoney/17   +('\n')+
                 "نصيب البنت الرابعة= "  + yourMoney/17   +('\n')+
                  "نصيب البنت الخامسة= " + yourMoney/17)};

               if (sons==6)   if(girls==6)              

               {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
               "نصيب الولد الاول= "  + yourMoney  /9   +('\n')+
               "نصيب الولد الثاني= "  +yourMoney  /9 +('\n')+
               "نصيب الولد الثالث= "  +yourMoney  /9  +('\n')+
               "نصيب الولد الرابع= "  +yourMoney  /9   +('\n')+
               "نصيب الولد الخامس= "  +yourMoney  /9   +('\n')+
               "نصيب الولد السادس= "  +yourMoney  /9   +('\n')+
                 "نصيب البنت الاولي= "  + yourMoney/18   +('\n')+
                 "نصيب البنت الثانية= "  + yourMoney/18   +('\n')+
                 "نصيب البنت الثالثة= "  + yourMoney/18  +('\n')+
                 "نصيب البنت الرابعة= "  + yourMoney/18  +('\n')+
                 "نصيب البنت الخامسة= "  + yourMoney/18  +('\n')+
                  "نصيب البنت السادسة= " + yourMoney/18 )};
if (sons==6)   if(girls==2)              

         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
         "نصيب الولد الاول= "  + yourMoney  /7   +('\n')+
         "نصيب الولد الثاني= "  +yourMoney  /7  +('\n')+
         "نصيب الولد الثالث= "  +yourMoney  /7   +('\n')+
         "نصيب الولد الرايع= "  +yourMoney  /7   +('\n')+
         "نصيب الولد الخامس= "  +yourMoney  /7   +('\n')+
         "نصيب الولد السادس= "  +yourMoney  /7   +('\n')+
           "نصيب البنت الاولي= "  + yourMoney/14   +('\n')+
            "نصيب البنت الثانية= " + yourMoney/14  )};

if (sons==0)   if(girls==6)              

{alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
"نصيب البنت الاولي= "  + yourMoney/6   +('\n')+
"نصيب البنت الثانية= "  + yourMoney/6   +('\n')+
"نصيب البنت الثالثة= "  + yourMoney/6   +('\n')+
"نصيب البنت الرابعة= "  + yourMoney/6   +('\n')+
"نصيب البنت الخامسة= "  + yourMoney/6   +('\n')+
"نصيب البنت السادسة= " + yourMoney/6 )};
if (sons==6)   if(girls==0)              

         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
           "نصيب الولد الاول= "  + yourMoney/6   +('\n')+
           "نصيب الولد الثاني= "  + yourMoney/6   +('\n')+
           "نصيب الولد الثالث= "  + yourMoney/6   +('\n')+
           "نصيب الولد الرابع= "  + yourMoney/6   +('\n')+
           "نصيب الولد الخامس= "  + yourMoney/6   +('\n')+
            "نصيب الولد السادس= " + yourMoney/6  )};

         if (sons==6)   if(girls==1)              

         {alert  ("الله يرحمها ويسامحها كانت طيبة"+('\n')+
           "نصيب الولد الاول= "  + yourMoney  /6.5   +('\n')+
           "نصيب الولد الثاني= "  +yourMoney  /6.5   +('\n')+
           "نصيب الولد الثالث= "  + yourMoney  /6.5   +('\n')+
           "نصيب الولد الرابع= "  + yourMoney  /6.5   +('\n')+
           "نصيب الولد الخامس= "  + yourMoney  /6.5   +('\n')+
           "نصيب الولد السادس= "  + yourMoney  /6.5   +('\n')+
            "نصيب البنت الاولي= " + yourMoney/7  )};


}

             // copy edtion//

          // let yourMoney = +prompt ( "ادخل الاموال ");
            // let wife = confirm ( "هل الزوجة علي قيدالحياة ?");        
            // // let manySons= yourMoney/sons;
            // let wifeMoney=yourMoney *1/8;
            // // let boys = yourMoney* 1/2;
            // // let girl=yourMoney-boys*1/2;
            // let res=yourMoney-wifeMoney;
            
            // if (wife==true) {  
            
            //     if(sons== 1 ) 
            //                 {  alert( wifeMoney+('\n')+ res) };
            
            //         if (sons==2) {alert  ("نصيب الزوجة= " +wifeMoney+('\n')+
            //           "نصيب الولد الاول= "+ res/2  +('\n')+
            //           "نصيب الولد الثاني= "+ res/2 )};
            
            //           if (sons==3) {alert  ("نصيب الزوجة= " +wifeMoney+('\n')+
            //           "نصيب الولد الاول= "  +   res/3  +('\n')+
            //           "نصيب الولد الثاني= "+   res/3 +('\n')+
            //           "نصيب الولد الاول= "  +   res/3  
            //           )};
              
             
            
            
            
            // }
            
            
            
            // else {   alert ("ليس للزوجة اموال") }
            
            
            
            
            
            
            // // if( sons == 1 )   {alert(boys)}
            // // else {alert("no mons") } 
            
            
    
    
    
    
    

  
  
